app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Dont waste your money."], ["created_at", "2015-07-16 00:21:48.464711"], ["movie_id", 3], ["rating", 3], ["updated_at", "2015-07-16 00:21:48.464711"], ["user_id", 1]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

    if @review.save